#+Title: A list of standard work tasks that a manager may need to do
#+Filetags: :Manager:Work:

* Questions for performance improvement
  :PROPERTIES:
  :CUSTOM_ID: questions_improvement
  :END:

  - Overall, how did we do?
  - Describe one activity that we did well
  - Describe one activity that we can stop doing, start doing or do better


* Weekday focus tasks                                              :Periodic:


** TODO Complete [[id:0aed5327-5834-4691-a8de-d6f630393554][work focus time tasks]]
   SCHEDULED: <2025-01-27 Mon 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-20 Mon 07:37]
   :END:
   - State "DONE"       from "TODO"       [2025-01-20 Mon 07:37]
   :LOGBOOK:
    CLOCK: [2025-01-20 Mon 06:15]--[2025-01-20 Mon 07:30] =>  1:15
   :END:


** TODO Complete [[id:0aed5327-5834-4691-a8de-d6f630393554][work focus time tasks]]
   SCHEDULED: <2025-01-28 Tue 08:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-22 Wed 06:06]
   :END:
   - State "DONE"       from "TODO"       [2025-01-22 Wed 06:06]
   :LOGBOOK:
   :END:


** TODO Complete [[id:0aed5327-5834-4691-a8de-d6f630393554][work focus time tasks]]
   SCHEDULED: <2025-01-29 Wed 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-22 Wed 07:38]
   :END:
   - State "DONE"       from "TODO"       [2025-01-22 Wed 07:38]
   :LOGBOOK:
   :END:



** TODO Complete [[id:0aed5327-5834-4691-a8de-d6f630393554][work focus time tasks]]
   SCHEDULED: <2025-01-30 Thu 08:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-23 Thu 09:54]
   :END:
   - State "DONE"       from "TODO"       [2025-01-23 Thu 09:54]
   :LOGBOOK:
   :END:


** TODO Complete [[id:0aed5327-5834-4691-a8de-d6f630393554][work focus time tasks]]
   SCHEDULED: <2025-01-31 Fri 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-24 Fri 17:19]
   :END:
   - State "DONE"       from "TODO"       [2025-01-24 Fri 17:19]
   :LOGBOOK:
   :END:


** Focus time tasks
:PROPERTIES:
:ID:       0aed5327-5834-4691-a8de-d6f630393554
:END:

   - (org-tags-view "M" "Work+Focus")


* Start of weekday prep tasks                                      :Periodic:
:PROPERTIES:
:COLUMNS: %40ITEM %RATIO %LAST_REPEAT %SCHEDULED %DEADLINE
:END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2025-01-13 Mon 10:11]
| Headline                    | Time   |      |
|-----------------------------+--------+------|
| *Total time*                | *0:30* |      |
|-----------------------------+--------+------|
| Start of weekday prep tasks | 0:30   |      |
| \_  Complete...             |        | 0:30 |
#+END:


** TODO Complete [[id:2f404a47-3da5-4141-9b84-e07f126f50d9][Start of weekday work list]]
   SCHEDULED: <2025-01-27 Mon 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-20 Mon 16:28]
   :END:
   - State "DONE"       from "TODO"       [2025-01-20 Mon 16:28]
   - State "DONE"       from "TODO"       [2025-01-20 Mon 15:43]
   - State "DONE"       from "TODO"       [2025-01-13 Mon 10:12]


** TODO Complete [[id:2f404a47-3da5-4141-9b84-e07f126f50d9][Start of weekday work list]]
   SCHEDULED: <2025-01-28 Tue 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-21 Tue 10:26]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 10:26]
   - State "DONE"       from "TODO"       [2025-01-15 Wed 09:16]
   :LOGBOOK:
   CLOCK: [2025-01-14 Tue 14:53]--[2025-01-14 Tue 15:00] =>  0:07
   :END:


** TODO Complete [[id:2f404a47-3da5-4141-9b84-e07f126f50d9][Start of weekday work list]]
   SCHEDULED: <2025-01-29 Wed 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-22 Wed 16:46]
   :END:
   - State "DONE"       from "TODO"       [2025-01-22 Wed 16:46]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 05:47]
   :LOGBOOK:
   CLOCK: [2025-01-15 Wed 09:22]--[2025-01-15 Wed 09:49] =>  0:27
   :END:


** TODO Complete [[id:2f404a47-3da5-4141-9b84-e07f126f50d9][Start of weekday work list]]
   SCHEDULED: <2025-01-30 Thu 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-24 Fri 09:41]
   :END:


   - State "DONE"       from "TODO"       [2025-01-24 Fri 09:41]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 16:26]


** TODO Complete [[id:2f404a47-3da5-4141-9b84-e07f126f50d9][Start of weekday work list]]
   SCHEDULED: <2025-01-31 Fri 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-24 Fri 17:19]
   :END:


   - State "DONE"       from "TODO"       [2025-01-24 Fri 17:19]
   - State "DONE"       from "TODO"       [2025-01-18 Sat 06:48]


** Start of weekday work list
:PROPERTIES:
:ID:       2f404a47-3da5-4141-9b84-e07f126f50d9
:END:
:LOGBOOK:
CLOCK: [2025-01-20 Mon 14:55]--[2025-01-20 Mon 15:43] =>  0:48
CLOCK: [2025-01-19 Sun 05:28]--[2025-01-19 Sun 05:48] =>  0:20
CLOCK: [2025-01-13 Mon 09:40]--[2025-01-13 Mon 10:10] =>  0:30
:END:

   - Check on phone that work tasks are properly categorized
   - Run [[#copy_Google_tasks][copy_Google_tasks]] on PC upstairs
   - Start Org clock (org-clock-in)
   - Review Google items (org-tags-view "M" "Google")
   - Add items to Confluence page for my meetings today
     (org-tags-view "M" "Work+Meetings")
   - Review my open items in Confluence
   - Send Slack messages (org-tags-view "M" "Work+Slack")
   - Send Teams messages (org-tags-view "M" "Work+Teams")
   - Send email (org-tags-view "M" "Work+Email")
   - Unread Slack messages
   - Unread EVC email
   - Stop Org clock (org-clock-out)


* End of weekday prep tasks                                        :Periodic:
:PROPERTIES:
:COLUMNS: %40ITEM %RATIO %LAST_REPEAT %SCHEDULED %DEADLINE
:END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2025-01-12 Sun 16:42]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |
#+END:

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2025-01-21 Tue 08:10]
| Headline                  | Time   |      |
|---------------------------+--------+------|
| *Total time*              | *1:36* |      |
|---------------------------+--------+------|
| End of weekday prep tasks | 1:36   |      |
| \_  Complete...           |        | 0:50 |
| \_  Complete...           |        | 0:46 |
#+END:


** TODO Complete [[id:6e13065f-3532-432e-b2de-761319dd0c35][End of weekday work list]]
   SCHEDULED: <2025-01-27 Mon 16:30 +7d>
   :PROPERTIES:
   :EFFORT: 00:30
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-20 Mon 17:03]
   :END:
   - State "DONE"       from "TODO"       [2025-01-20 Mon 17:03]
   - State "DONE"       from "TODO"       [2025-01-13 Mon 19:39]
   - State "DONE"       from "TODO"       [2025-01-12 Sun 16:15]
   - State "DONE"       from "TODO"       [2025-01-11 Sat 16:53]
   - State "DONE"       from "TODO"       [2025-01-10 Fri 17:22]
   - State "DONE"       from "TODO"       [2025-01-09 Thu 05:55]
   - State "DONE"       from "TODO"       [2025-01-08 Wed 08:16]
   - State "DONE"       from "TODO"       [2025-01-08 Wed 04:54]
   - State "DONE"       from "TODO"       [2025-01-06 Mon 18:13]
   - State "DONE"       from "TODO"       [2025-01-01 Wed 17:28]
   - State "DONE"       from "TODO"       [2025-01-01 Wed 16:53]
   - State "DONE"       from "TODO"       [2025-01-01 Wed 09:30]
   - State "DONE"       from "TODO"       [2024-12-30 Mon 17:25]
   :LOGBOOK:
   CLOCK: [2025-01-13 Mon 18:59]--[2025-01-13 Mon 19:39] =>  0:40
   CLOCK: [2024-12-30 Mon 17:15]--[2024-12-30 Mon 17:25] =>  0:10
   :END:


** TODO Complete [[id:6e13065f-3532-432e-b2de-761319dd0c35][End of weekday work list]]
   SCHEDULED: <2025-01-28 Tue 16:30 +7d>
   :PROPERTIES:
   :EFFORT: 00:30
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-22 Wed 06:06]
   :END:


   - State "DONE"       from "TODO"       [2025-01-22 Wed 06:06]
   - State "DONE"       from "TODO"       [2025-01-15 Wed 09:16]


** TODO Complete [[id:6e13065f-3532-432e-b2de-761319dd0c35][End of weekday work list]]
   SCHEDULED: <2025-01-29 Wed 16:30 +7d>
   :PROPERTIES:
   :EFFORT: 00:30
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-22 Wed 17:14]
   :END:


   - State "DONE"       from "TODO"       [2025-01-22 Wed 17:14]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 05:47]


** TODO Complete [[id:6e13065f-3532-432e-b2de-761319dd0c35][End of weekday work list]]
   SCHEDULED: <2025-01-30 Thu 16:30 +7d>
   :PROPERTIES:
   :EFFORT: 00:30
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-24 Fri 09:41]
   :END:
   - State "DONE"       from "TODO"       [2025-01-24 Fri 09:41]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 17:14]
   :LOGBOOK:
   CLOCK: [2025-01-16 Thu 16:28]--[2025-01-16 Thu 17:14] =>  0:46
   :END:


** TODO Complete [[id:6e13065f-3532-432e-b2de-761319dd0c35][End of weekday work list]]
   SCHEDULED: <2025-01-31 Fri 16:30 +7d>
   :PROPERTIES:
   :EFFORT: 00:30
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-25 Sat 05:26]
   :END:


   - State "DONE"       from "TODO"       [2025-01-25 Sat 05:26]
   - State "DONE"       from "TODO"       [2025-01-18 Sat 06:48]


** End of weekday work list
:PROPERTIES:
:ID:       6e13065f-3532-432e-b2de-761319dd0c35
:END:
:LOGBOOK:
CLOCK: [2025-01-22 Wed 17:01]--[2025-01-23 Thu 08:17] => 15:16
:END:

   - Start Org clock (org-clock-in)
   - Set up classical music
   - Unread EVC Slack messages
   - Unread EVC email
   - Copy over action items from physical notebook
   - Close all periodic tasks from agenda (org-agenda t "a")
   - Commit files to Github
   - Outlook Todo SE
   - Unread SE email
   - Unread SE Teams messages
   - [Th] Provide recognition using Slack workflow
   - [F] Clean up calendar for the upcoming week through the following
     Monday
   - Stop Org clock (org-clock-out)
   - Pack medication and breakfast for office, if needed


* Start of new week prep tasks                                     :Periodic:
#+BEGIN: columnview :hlines 1 :id local :format "%20ITEM %10EFFORT{:} %10RATIO{} %DEADLINE %SCHEDULED"
| ITEM                                                                                     | EFFORT | RATIO | DEADLINE             | SCHEDULED                  |
|------------------------------------------------------------------------------------------+--------+-------+----------------------+----------------------------|
| Start of new week prep tasks                                                             |   1:45 |       |                      |                            |
| Complete start of new week prep tasks (list below)                                       |  01:00 |  2.00 |                      | [2025-01-26 Sun 06:00 +7d] |
| Slack Tech staff leads to complete their [[https://evconnect.atlassian.net/wiki/spaces/EV/pages/3991273478/Technology+Leadership+Team+Weekly+Staff+Meetings#Action-items][staff meeting]] action items                      |        |       | [2025-01-26 Sun +7d] |                            |
| Update [[https://evconnect.atlassian.net/wiki/spaces/EV/pages/3991273478][staff meeting]] agenda                                                              |  00:15 |  0.40 | [2025-01-26 Sun +7d] |                            |
| [[id:bb62fc36-9d1f-4426-8f23-bc2494720adf][Code to generate next 1-1]]                                                                |        |       |                      | [2025-01-26 Sun +7d]       |
| Send agenda suggestions for EVC Leadership weekly meeting                                |        |       | [2025-01-26 Sun +7d] |                            |
| Book conference rooms for my meetings for the next 4 weeks                               |        |       |                      | [2025-02-16 Sun +4w]       |
| Have a career conversation with direct reports                                           |  00:15 |  0.40 |                      | [2025-03-16 Sun +8w]       |
| Ask direct reports: "Overall, how are you doing?" and "Overall, how is your team doing?" |  00:15 |  0.40 |                      | [2025-04-20 Sun +12w]      |
| Ask manager for feedback on performance based on [[#questions_improvement][these questions]] every 3 months          |        |       |                      | [2025-03-16 Sun +12w]      |
#+END:

#+BEGIN: clocktable :scope subtree :tstart "<-1w>" :tend "<now>" :maxlevel 2
#+CAPTION: Clock summary at [2025-01-21 Tue 09:02]
| Headline                                  | Time   |      |
|-------------------------------------------+--------+------|
| *Total time*                              | *0:32* |      |
|-------------------------------------------+--------+------|
| Start of new week prep tasks              | 0:32   |      |
| \_  Slack Tech staff leads to complete... |        | 0:06 |
| \_  [[id:bb62fc36-9d1f-4426-8f23-bc2494720adf][Code to generate next 1-1]]             |        | 0:06 |
| \_  Have a career conversation with...    |        | 0:20 |
#+END:


** TODO Complete start of new week prep tasks (list below)
   SCHEDULED: <2025-01-26 Sun 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-01-21 Tue 09:03]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 09:03]
:LOGBOOK:
CLOCK: [2025-01-12 Sun 17:30]--[2025-01-12 Sun 17:58] =>  0:28
:END:


** TODO Slack Tech staff leads to complete their [[https://evconnect.atlassian.net/wiki/spaces/EV/pages/3991273478/Technology+Leadership+Team+Weekly+Staff+Meetings#Action-items][staff meeting]] action items
   DEADLINE: <2025-01-26 Sun +7d>
   :PROPERTIES:
   :LAST_REPEAT: [2025-01-21 Tue 08:31]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:31]
   :LOGBOOK:
   CLOCK: [2025-01-21 Tue 08:25]--[2025-01-21 Tue 08:31] =>  0:06
   :END:
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:34]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:45]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 06:36]
   - State "DONE"       from "TODO"       [2024-12-16 Mon 09:00]
   - State "DONE"       from "TODO"       [2024-12-08 Sun 20:04]
   - State "DONE"       from "TODO"       [2024-12-01 Sun 21:04]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-24 Sun 20:44]
   :END:
   - State "DONE"       from "TODO"       [2024-11-24 Sun 20:44]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-18 Mon 10:19]
   :END:
   - State "DONE"       from "TODO"       [2024-11-18 Mon 10:19]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-10 Sun 16:34]
   :END:
   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:34]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-04 Mon 09:57]
   :END:
   - State "DONE"       from "TODO"       [2024-11-04 Mon 09:57]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-27 Sun 20:15]
   :END:
   - State "DONE"       from "TODO"       [2024-10-27 Sun 20:15]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-20 Sun 15:49]
   :END:
   - State "DONE"       from "TODO"       [2024-10-20 Sun 15:49]
   - State "DONE"       from "TODO"       [2024-10-14 Mon 11:52]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


** TODO Update [[https://evconnect.atlassian.net/wiki/spaces/EV/pages/3991273478][staff meeting]] agenda
   DEADLINE: <2025-01-26 Sun +7d>
   :PROPERTIES:
   :LAST_REPEAT: [2025-01-21 Tue 08:33]
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:33]
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:48]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:45]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 06:36]


** TODO Run code below to generate next 1-1
SCHEDULED: <2025-01-26 Sun +7d>
:PROPERTIES:
:LAST_REPEAT: [2025-01-21 Tue 09:02]
:END:
- State "DONE"       from "TODO"       [2025-01-21 Tue 09:02]
:LOGBOOK:
CLOCK: [2025-01-21 Tue 08:56]--[2025-01-21 Tue 09:02] =>  0:06
:END:
- State "DONE"       from "TODO"       [2025-01-05 Sun 21:06]
- State "DONE"       from "TODO"       [2024-12-29 Sun 13:59]
:PROPERTIES:
:EFFORT:  00:15
:BENEFIT: 10
:RATIO: 0.40
:END:

[[id:bb62fc36-9d1f-4426-8f23-bc2494720adf][Code to generate next 1-1]]



** TODO Send agenda suggestions for EVC Leadership weekly meeting
   DEADLINE: <2025-01-26 Sun +7d>
   :PROPERTIES:
   :LAST_REPEAT: [2025-01-21 Tue 08:33]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:33]
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:36]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:44]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 11:38]
   - State "DONE"       from "TODO"       [2024-12-16 Mon 08:36]
   - State "DONE"       from "TODO"       [2024-12-08 Sun 20:09]
   - State "DONE"       from "TODO"       [2024-12-01 Sun 20:33]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-24 Sun 20:52]
   :END:
   - State "DONE"       from "TODO"       [2024-11-24 Sun 20:52]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-17 Sun 08:10]
   :END:
   - State "DONE"       from "TODO"       [2024-11-17 Sun 08:10]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-10 Sun 16:59]
   :END:
   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:59]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-04 Mon 20:33]
   :END:
   - State "DONE"       from "TODO"       [2024-11-04 Mon 20:33]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-27 Sun 20:30]
   :END:
   - State "DONE"       from "TODO"       [2024-10-27 Sun 20:30]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2024-10-20 Sun 15:42]
   :END:
   - State "DONE"       from "TODO"       [2024-10-20 Sun 15:42]


** TODO Book conference rooms for my meetings for the next 4 weeks
SCHEDULED: <2025-02-16 Sun +4w>
   :PROPERTIES:
   :LAST_REPEAT: [2025-01-21 Tue 08:34]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-01-05 Sun 21:06]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:43]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 11:40]
   - State "DONE"       from "TODO"       [2024-12-15 Sun 20:59]
   - State "DONE"       from "TODO"       [2024-12-04 Wed 07:39]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-27 Wed 06:44]
   :END:
   - State "DONE"       from "TODO"       [2024-11-27 Wed 06:44]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-20 Wed 20:35]
   :END:
   - State "DONE"       from "TODO"       [2024-11-20 Wed 20:35]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-14 Thu 06:03]
   :END:
   - State "DONE"       from "TODO"       [2024-11-14 Thu 06:03]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-06 Wed 07:59]
   :END:
   - State "DONE"       from "TODO"       [2024-11-06 Wed 07:59]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:





** TODO Have a career conversation with direct reports
   SCHEDULED: <2025-03-16 Sun +8w>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-21 Tue 08:55]
   :END:
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:55]
   :LOGBOOK:
   CLOCK: [2025-01-21 Tue 08:34]--[2025-01-21 Tue 08:54] =>  0:20
   :END:


   - State "DONE"       from "TODO"       [2024-11-18 Mon 10:19]
   - State "DONE"       from "TODO"       [2024-11-06 Wed 08:11]


** TODO Ask direct reports: "Overall, how are you doing?" and "Overall, how is your team doing?"
   SCHEDULED: <2025-04-20 Sun +12w>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-01-12 Sun 16:58]
   :END:


   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:58]
   - State "DONE"       from "TODO"       [2024-08-12 Mon 09:49]
   - State "DONE"       from "TODO"       [2024-05-20 Mon 13:01]
   - State "DONE"       from "TODO"       [2024-03-03 Sun 17:56]
   - State "DONE"       from "TODO"       [2023-11-20 Mon 08:50]
   - State "DONE"       from "TODO"       [2023-08-28 Mon 06:43]
   - State "DONE"       from "TODO"       [2023-06-05 Mon 13:09]
   - State "DONE"       from "TODO"       [2023-04-03 Mon 10:06]


** TODO Ask manager for feedback on performance based on [[#questions_improvement][these questions]] every 3 months
   SCHEDULED: <2025-03-16 Sun +12w>
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-28 Thu 09:48]
   :END:


   - State "DONE"       from "TODO"       [2024-11-28 Thu 09:48]
   - State "DONE"       from "TODO"       [2024-09-04 Wed 16:15]
   - State "DONE"       from "TODO"       [2024-06-14 Fri 07:54]
   - State "DONE"       from "TODO"       [2024-03-24 Sun 20:58]
   - State "DONE"       from "TODO"       [2023-12-30 Sat 08:27]
   - State "DONE"       from "TODO"       [2023-10-05 Thu 16:15]
   - State "DONE"       from "TODO"       [2023-07-12 Wed 13:02]
   - State "DONE"       from "TODO"       [2023-04-05 Wed 18:17]



* Organization

  - Once a quarter, review team succession planning list
    (see manager tools recommendations on ready now/ready later)


* Town hall meetings

  Town hall meetings are a good way to broadcast information, discuss
  financial results, have detailed Q&A etc. I conduct town halls once
  every quarter.


** Task list for town hall meetings

#+NAME: town_hall_tasks
|-------------------------------------------------------------------------------+-----|
| Ask someone to give spotlight presentation in town hall                       | -21 |
| Setup site for questions and post-meeting survey to be submitted in town hall | -14 |
| Setup updates and prep financial information slides for town hall             |  -7 |
| Answer questions left-over from town hall                                     |  +1 |
| Give recognition/swag for good questions and organizers in town hall          |  +7 |
| Release post-meeting survey results from town hall                            |  +7 |
| Setup tasks for next town hall meeting date                                   |  +7 |
|-------------------------------------------------------------------------------+-----|

#+CALL: ../task_management/Tasks.org:generate_tasks_from_offset(tab=town_hall_tasks, start_date="2025-02-05", task_time="08:00")

#+RESULTS:
:results:


*** TODO Setup site for questions and post-meeting survey to be submitted in town hall
    SCHEDULED: <2025-01-28 Tue>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Setup updates and prep financial information slides for town hall
    SCHEDULED: <2025-01-29 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Answer questions left-over from town hall
    SCHEDULED: <2025-02-06 Thu>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Give recognition/swag for good questions and organizers in town hall
    SCHEDULED: <2025-02-12 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Release post-meeting survey results from town hall
    SCHEDULED: <2025-02-12 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Setup tasks for next town hall meeting date
    SCHEDULED: <2025-02-12 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


:end:
:results:
